In [55]:
#importando bibliotecas
import os
import pymysql
import pandas as pd

#abrindo conexao com mysql
conn = pymysql.connect(
    host='127.0.0.1',
    port=int(3306),
    user='root',
    passwd='emporium',
    db='solar_teste',
    charset='utf8mb4')

#criando cursor
cursor = conn.cursor()

In [56]:
#executa o comando
cursor.execute("Insert into solar values (10,'Cassio')")

1

In [57]:
df = pd.read_sql_query(
"select * from solar",conn)
df.tail(5)

   id    nome
1   2  Heitor
2   3  Marina
3   4  Napalm
4   5  Victor
5  10  Cassio